# 3_sem_java
Все лабы лежат на сайте https://sites.google.com/site/famcsbsu/labs/programming/task1
В архивах 1-3 лежат задачи для варианта 2(для 3 есть еще в3)

Lab 1
Функция представлена в виде своего ряда Тейлора. Вычислить приближённое значение суммы этого бесконечного ряда. Вычисления заканчивать, когда очередное слагаемое окажется по модулю меньше заданного числа e. Вид этого числа определяется  следующим условием:
 e = 10-k, где k – натуральное число.
Bсю логику приложения разместить в отдельном классе; обработать исключения; clean code.

Lab 2 
Размерность матрицы ввести с клавиатуры. Элементы матрицы задать случайным образом.
Определить, является ли матрица симметричной (относительно главной диагонали). Вывести на экран соответствующее сообщение. Найти максимальный элемент среди стоящих на главной и побочной  диагонали и поменять местами с элементом, стоящим на пересечении этих диагоналей.

Lab 3
Дан текст. Вывести на экран слова этого текста в порядке, соответствующем латинскому алфавиту.
Признак конца ввода текста – пустая строка.

Lab 3v3
Дан текст. Разбить каждую строку текста на две подстроки, причем первая длиной k-символов (если на k-ю позицию попадает слово, то его следует отнести ко второй строке, дополнив первую пробелами до k-позиций).

Lab 4
В Java программе удалить все комментарии из
   ``` /*
     * To change this template, choose Tools | Templates
     * and open the template in the editor.
     */
    package lab4;
    /**
     *
     * @author
     */
    public class Main {
        /**
         * @param args the command line arguments
         */
        public static void main(String[] args) {
            // TODO code application logic here
            int i /*jjjjj*/ = 0;
            String s = "\t"; String s1 = "/*hello"; String s2 = ", world!*/";
            char c = '\t';
            char cc = '/';
            String str = "'";//COMMENT
            char ccc = '*';
            char cccc = '"'; //"hjhkjhkj
            System.out.println("/*dfsdf*////****/**//**Hello\", \\'world!\\");/**/ //
            char cccc = 100/'*';
            char f = '\\';
            char f1 = '\n';
            char f2 = '\"';       
            "".getBytes();
            //  \u000d System.out.println("Bye!");
        }
    }```
 
Lab 5
Входной файл input1.html содержит текст, написанный на языке HTML.
В тесте находятся теги. В одной строке может быть несколько тегов. Теги находятся в угловых скобках, каждому открывающему тегу ставится в соответствие закрывающий тег. Например, пара тегов<b></b>.
Между тегами находится текст, причем теги не разрывают текст. Например, при поиске слова hello комбинация h<b><i>el</i>l</b>o должна быть найдена.
Гарантируется,что страница HTML является корректной, т.е. все символы "<" и ">" используются только в тегах, все теги записаны корректно.
Входной файл input2.in содержит список фрагментов текста, которые нужно найти в первом файле, записанных через разделители (точка с запятой). Может быть несколько строк.

Lab 6
Входной файл input содержит данные в формате CSV.
Каждая запись в файле расположена на новой строке.
Разделителем между полями одной записи является символ точка с запятой (';').
Если значения какого-то поля записи нет, то разделить все равно присутствует.
Обязательными для заполнения являются только те поля, по которым строятся запросы для выборки данных.
Формат входных данных
Имеется список компаний.
Каждый элемент списка содержит следующие поля:

   Наименование (name)
    Краткое наименование (shortTitle)
    Дата актуализации (dateUpdate)
    Адрес (address)
    Дата основания (dateFoundation)
    Численность сотрудников (countEmployees)
    Аудитор (auditor)
    Телефон (phone)
    Email (email)
    Отрасль (branch)
    Вид деятельности (activity)
    Адрес страницы в Интернет (internetAddress/link)

 
Выходные данные
1. Прочитать данные из входного файла.
2. Выбрать данные по запросу.
3. Записать полученные данные в два файла (в XML-формате и JSON).

Lab 7
Необходимо для задачи лабораторной работы 6 предусмотреть ввод условия для выбора информации с помощью SQL-запроса. 
 
Для выполнения лабораторной работы:
 
1. Изучите синтаксис построения SQL-запроса SELECT.
    Рассмотрите варианты написания запроса без использования именования столбцов.
    Имя таблицы для запроса: dataBase.
    Регистр написания ключевых слов и наименований полей в SQL-запросе не учитывайте.
2. Выполните разбор поступившего SQL-запроса.
3. Выполните выбор информации в соответствии с запросом.
 
Входные данные
Запросы расположите во входном текстовом файле requests.txt построчно (каждый запрос на новой строке).
 
Выходные данные
Выходные файлы именуйте с номером, соответствующим порядковому номеру запроса во входном файле. 
Например, request1.xml, request1.json, request2.xml, request2.json и т.д.
 
Запросы
1. Найти компанию по краткому наименованию.
2. Выбрать компании по виду деятельности.
3. Выбрать компании по численности сотрудников в определенном промежутке (с и по).
 
Примечания
1. Ваша программа должна игнорировать различие между строчными и прописными буквами.
2. Необходимо вести статистику работы приложения в файле logfile.txt (дата и время запуска приложения, успешно ли выполнено, исключения и т.п.).  
Lab 8
Написать программу для консольного процесса, который состоит из двух потоков: Main (главный поток) и Sort.

 

Поток Main должен выполнить следующие действия:

·  создать массив целых чисел (размерность вводится пользователем с клавиатуры), элементы которого задаются программно случайными числами;

·       вывести размерность и элементы исходного массива на консоль;

·    запросить у пользователя порядок сортировки массива (возрастание/убывание по значению, возрастание/убывание по количеству цифр);

·       запустить поток Sort;

·       вывести на консоль элементы отсортированного массива после завершения работы потока Sort.

 

Поток Sort должен выполнить следующие действия:

·       отсортировать элементы введенного массива в соответствии с заданным порядком (использовать Comparator).
 Lab 9
Для выполнения заданий использовать регулярные выражения.
Каждое задание реализовать в отдельном методе.
Строку получать из текстового файла input.txt.
Результат работы методов записывать в выходной текстовый файл output.txt.
 
    1. Из заданной строки исключить символы, расположенные внутри круглых скобок. Сами скобки тоже должны быть исключены.

    2. Из заданной строки удалить из каждой группы идущих подряд цифр, в которой более двух цифр, все цифры, начиная с третьей.
    
    3. Из заданной строки удалить из каждой группы идущих подряд цифр все незначащие нули.
 Lab 10(91)
Иногда при работе с web-страницей приходится сталкиваться с неправильными ссылками.
Вы пытаетесь перейти по ссылке, а вам приходит сообщение, что такого документа не существует или нет страницы по указанному адресу.
Необходимо реализовать проверку страницы на корректность ссылок.

Входной файл input.html содержит ссылку на начальный web-ресурс или текст, написанный на языке HTML.

Выходной файл output1.txt должен содержать список, содержащий пары:
ссылка – title страницы, если речь идет о ссылке на web-страницу и
ссылка – размер файла, если речь идет о файле,
в том случае, если ресурс был найден.

Выходной файл output2.txt должен содержать список ссылок, по которым ресурс не был найден.
